# Chap 05

## 5.1 pandas 자료구조 소개

### 5.1.1 Series

In [2]:
from pandas import Series, DataFrame

In [3]:
import pandas as pd

In [4]:
obj = Series([4,7,-5,3])

In [5]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [7]:
obj.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [8]:
obj2 = Series([4,7,-5,3], index=['d','b','a','c'])

In [9]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [10]:
obj2['a']

-5

In [11]:
obj[['c','a','d']]

c   NaN
a   NaN
d   NaN
dtype: float64

In [12]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [13]:
obj2[obj2>0]

d    4
b    7
c    3
dtype: int64

In [14]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [15]:
import numpy as np
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [16]:
'b' in obj2

True

In [17]:
'e' in obj2

False

In [18]:
sdata = {'Ohio':30555,'Texas':71000,'Oregon':16000,'Utah':5000}

In [19]:
obj3=Series(sdata)

In [20]:
obj3

Ohio      30555
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [21]:
states=['California','Ohio','Oregon','Texas']

In [22]:
obj4=Series(sdata,index=states)

In [23]:
obj4

California      NaN
Ohio          30555
Oregon        16000
Texas         71000
dtype: float64

In [24]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [25]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [26]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [27]:
obj3

Ohio      30555
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [28]:
obj4

California      NaN
Ohio          30555
Oregon        16000
Texas         71000
dtype: float64

In [29]:
obj3 + obj4

California       NaN
Ohio           61110
Oregon         32000
Texas         142000
Utah             NaN
dtype: float64

In [30]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California      NaN
Ohio          30555
Oregon        16000
Texas         71000
Name: population, dtype: float64

In [31]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [32]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### 5.1.2 DataFrame

In [33]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [34]:
frame = DataFrame(data)

In [35]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [36]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [37]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'], index=['one', 'two', 'three', 'four', 'five'])

In [38]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [39]:
frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

In [40]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [41]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [42]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [43]:
frame2.ix['three']   #index가 three

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [44]:
frame2['debt'] = 16.5

In [45]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [46]:
frame2['debt']=np.arange(5.)

In [47]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [48]:
val=Series([-1.2,-1.5,-1.7],index=['two','four','five'])

In [49]:
frame2['dept'] = val

In [50]:
frame2

       year   state  pop  debt  dept
one    2000    Ohio  1.5     0   NaN
two    2001    Ohio  1.7     1  -1.2
three  2002    Ohio  3.6     2   NaN
four   2001  Nevada  2.4     3  -1.5
five   2002  Nevada  2.9     4  -1.7

In [51]:
frame2['eastern'] = frame2.state == 'Ohio'

In [52]:
frame2

       year   state  pop  debt  dept eastern
one    2000    Ohio  1.5     0   NaN    True
two    2001    Ohio  1.7     1  -1.2    True
three  2002    Ohio  3.6     2   NaN    True
four   2001  Nevada  2.4     3  -1.5   False
five   2002  Nevada  2.9     4  -1.7   False

In [53]:
del frame2['eastern']

In [54]:
frame2.columns

Index([u'year', u'state', u'pop', u'debt', u'dept'], dtype='object')

In [55]:
frame2

       year   state  pop  debt  dept
one    2000    Ohio  1.5     0   NaN
two    2001    Ohio  1.7     1  -1.2
three  2002    Ohio  3.6     2   NaN
four   2001  Nevada  2.4     3  -1.5
five   2002  Nevada  2.9     4  -1.7

In [56]:
pop = {'Nevada':{2001:2.4,2002:2.9},'Ohio':{2000:1.5,2001:1.7,2002:3.6}}

In [57]:
frame3 = DataFrame(pop)

In [58]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [59]:
frame3.T   #역치

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [60]:
DataFrame(pop,index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [61]:
pdata={'Ohio':frame3['Ohio'][:-1],'Nevada':frame3['Nevada'][:2]}

In [62]:
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [63]:
pdata

{'Nevada': 2000    NaN
 2001    2.4
 Name: Nevada, dtype: float64, 'Ohio': 2000    1.5
 2001    1.7
 Name: Ohio, dtype: float64}

In [64]:
frame3.index.name='year';frame3.columns.name='state'

In [65]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [66]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [67]:
frame2.values

array([[2000L, 'Ohio', 1.5, 0.0, nan],
       [2001L, 'Ohio', 1.7, 1.0, -1.2],
       [2002L, 'Ohio', 3.6, 2.0, nan],
       [2001L, 'Nevada', 2.4, 3.0, -1.5],
       [2002L, 'Nevada', 2.9, 4.0, -1.7]], dtype=object)

### 5.1.3 색인 객체

In [68]:
obj = Series(range(3),index=['a','b','c'])

In [69]:
index = obj.index

In [70]:
index

Index([u'a', u'b', u'c'], dtype='object')

In [71]:
index[1:]

Index([u'b', u'c'], dtype='object')

In [72]:
index[1] = 'd'
#TypeError: Indexes does not support mutable operations

TypeError: Indexes does not support mutable operations

In [160]:
index = pd.Index(np.arange(3))

In [161]:
index

Int64Index([0, 1, 2], dtype='int64')

In [162]:
obj2 = Series([1.5, -2.5, 0], index=index)

In [163]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [164]:
obj2.index is index

True

In [165]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [166]:
'Ohio' in frame3

True

In [167]:
2000 in frame3  #column에 존재하는지

False

In [168]:
2000 in frame3.index  #index에 존재하는지

True

In [169]:
2003 in frame3.index

False

## 핵심기능

### 5.2.1 재색인

In [170]:
obj = Series([4.5, 7.2, -5.3, 3.6],index=['d','b','a','c'])

In [171]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [172]:
obj2 = obj.reindex(['a','b','c','d','e'])   #reindex 색인다시설정

In [173]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [174]:
obj.reindex(['a','b','c','d','e'],fill_value=0) #NaN을 0으로

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [175]:
obj3 = Series(['blue','purple','yellow'],index=[0,2,4])

In [176]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [177]:
obj3.reindex(range(6),method="ffill")
#range(6)까지 index를 앞의 값으로 채워준다

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [178]:
obj3 = Series(['blue','purple','yellow'],index=[0,2,4])

In [179]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [180]:
obj3.reindex(range(6),method="bfill")
# 뒤의 값으로 채워준다

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [181]:
frame = DataFrame(np.arange(9).reshape((3,3)),index=['a','c','d'],
                  columns=['Ohio','Texas','California'])

In [182]:
frame = DataFrame(np.arange(9).reshape(3,3),index=['a','c','d'],
                  columns=['Ohio','Texas','California'])

In [183]:
frame.shape

(3, 3)

In [184]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [185]:
frame2 = frame.reindex(['a','b','c','d'])

In [186]:
frame2

   Ohio  Texas  California
a     0      1           2
b   NaN    NaN         NaN
c     3      4           5
d     6      7           8

In [187]:
states = ['Texas', 'Utah', 'California']

In [188]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [189]:
frame.reindex(index=['a','b','c','d'],method='ffill',columns=states)

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [190]:
frame.ix[['a','b','c','d'],states]

   Texas  Utah  California
a      1   NaN           2
b    NaN   NaN         NaN
c      4   NaN           5
d      7   NaN           8

### 5.2.2 하나의 로우 또는 칼럼 삭제하기

In [191]:
obj = Series(np.arange(5.),index=['a','b','c','d','e'])

In [192]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: float64

In [193]:
new_obj = obj.drop('c')  #c 를 drop한다

In [194]:
new_obj

a    0
b    1
d    3
e    4
dtype: float64

In [195]:
obj.drop(['d','c'])

a    0
b    1
e    4
dtype: float64

In [196]:
data = DataFrame(np.arange(16).reshape(4,4),index = ['Ohio','Colorado','Utah','New York'],
                 columns=['one','two','three','four'])

In [197]:
data.drop(['Colorado','Utah'])

          one  two  three  four
Ohio        0    1      2     3
New York   12   13     14    15

In [198]:
data.drop('two',axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [199]:
data.drop(['two','four'],axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [200]:
data.drop(['Ohio','Utah'],axis=0)

          one  two  three  four
Colorado    4    5      6     7
New York   12   13     14    15

### 5.2.3 색인하기, 선택하기, 거르기

In [201]:
obj = Series(np.arange(4.),index=['a','b','c','d'])

In [202]:
obj

a    0
b    1
c    2
d    3
dtype: float64

In [203]:
obj['b']

1.0

In [204]:
obj[1]

1.0

In [205]:
obj[2:4]

c    2
d    3
dtype: float64

In [206]:
obj[['b', 'a', 'd']]

b    1
a    0
d    3
dtype: float64

In [207]:
obj[[1, 3]]

b    1
d    3
dtype: float64

In [208]:
obj[obj < 2]

a    0
b    1
dtype: float64

In [209]:
obj['b':'c']

b    1
c    2
dtype: float64

In [210]:
obj[1:3]

b    1
c    2
dtype: float64

In [211]:
obj['b':'c'] = 5
obj

a    0
b    5
c    5
d    3
dtype: float64

In [212]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [213]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [214]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [215]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [216]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [217]:
data['three'] > 5

Ohio        False
Colorado     True
Utah         True
New York     True
Name: three, dtype: bool

In [218]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [219]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [220]:
data[data < 5] = 0

In [221]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [222]:
data.ix['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [223]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [224]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [225]:
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [226]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### 5.2.4 산술연산과 데이터 정렬

In [227]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [228]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [229]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [230]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [231]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'), index=['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [232]:
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [233]:
df1 + df2

           b   c   d   e
Colorado NaN NaN NaN NaN
Ohio       3 NaN   6 NaN
Oregon   NaN NaN NaN NaN
Texas      9 NaN  12 NaN
Utah     NaN NaN NaN NaN

In [234]:
df1.add(df2, fill_value=0)

          b   c   d   e
Colorado  6   7   8 NaN
Ohio      3   1   6   5
Oregon    9 NaN  10  11
Texas     9   4  12   8
Utah      0 NaN   1   2

In [235]:
df1.reindex(columns=df2.columns, fill_value=0)
#df1에서 df2에 존재하는 columns를 탐색,NaN=0

          b  d  e
Ohio      0  2  0
Texas     3  5  0
Colorado  6  8  0

### DataFrame 과 Series 간의 연산

In [236]:
arr = np.arange(12.).reshape((3, 4))

In [237]:
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [238]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [239]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [397]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.ix[0]

In [398]:
series

b    0
d    1
e    2
Name: Utah, dtype: float64

In [399]:
frame - series

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

In [400]:
series2 = Series(range(3), index=['b', 'e', 'f'])

In [401]:
frame + series2
#겹치는 부분이 없으면 NaN

        b   d   e   f
Utah    0 NaN   3 NaN
Ohio    3 NaN   6 NaN
Texas   6 NaN   9 NaN
Oregon  9 NaN  12 NaN

In [245]:
series3 = frame['d']

In [246]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [247]:
series3

Utah       1
Ohio       4
Texas      7
Oregon    10
Name: d, dtype: float64

In [248]:
frame.sub(series3, axis=0)

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Texas  -1  0  1
Oregon -1  0  1

### 5.2.5 함수 적용과 매핑

In [402]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [403]:
frame

               b         d         e
Utah   -1.136045 -0.023149  0.352135
Ohio   -0.180187 -0.398848 -0.176394
Texas  -0.945643 -0.790997 -1.019344
Oregon  0.114370  1.086749  1.911401

In [404]:
np.abs(frame)

               b         d         e
Utah    1.136045  0.023149  0.352135
Ohio    0.180187  0.398848  0.176394
Texas   0.945643  0.790997  1.019344
Oregon  0.114370  1.086749  1.911401

In [405]:
f = lambda x: x.max() - x.min()

In [406]:
f

In [408]:
frame.apply(f)
#각 열의 최대값과 최소값의 차 구하기

b    1.250416
d    1.877746
e    2.930745
dtype: float64

In [409]:
frame.apply(f, axis=1)
#각 행의 최대값과 최소값의 차 구하기

Utah      1.488181
Ohio      0.222454
Texas     0.228347
Oregon    1.797031
dtype: float64

In [414]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])

In [415]:

frame.apply(f)

            b         d         e
min -1.136045 -0.790997 -1.019344
max  0.114370  1.086749  1.911401

In [412]:
frame.apply?

In [416]:
def f(x):
    return x.max() - x.min()

In [417]:

frame.apply(f)

b    1.250416
d    1.877746
e    2.930745
dtype: float64

### map내장함수
- seq 시퀀스 자료형이 지닌 각 원소값들에 대해 function에 적용한 결과를 동일 시퀀스 자료형으로 반환한다.

In [423]:
format = lambda x: '%.2f' % x
frame.applymap(format)  #모든 칼럼에 적용할 수 있다.

            b      d      e
Utah    -1.14  -0.02   0.35
Ohio    -0.18  -0.40  -0.18
Texas   -0.95  -0.79  -1.02
Oregon   0.11   1.09   1.91

In [424]:
format

In [425]:
frame['e'].map(format)

Utah       0.35
Ohio      -0.18
Texas     -1.02
Oregon     1.91
Name: e, dtype: object

In [426]:
d=10.3434

In [427]:
'%.2f'%d

'10.34'

###5.2.6 정렬과 순위

In [428]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])

In [429]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [431]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [260]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'], columns=['d', 'a', 'b', 'c'])

In [432]:
frame.sort_index()
#로우의 색인 순으로 정렬

               b         d         e
Ohio   -0.180187 -0.398848 -0.176394
Oregon  0.114370  1.086749  1.911401
Texas  -0.945643 -0.790997 -1.019344
Utah   -1.136045 -0.023149  0.352135

In [433]:
frame.sort_index(axis=1)
#칼럼의 색인 순으로 정렬

               b         d         e
Utah   -1.136045 -0.023149  0.352135
Ohio   -0.180187 -0.398848 -0.176394
Texas  -0.945643 -0.790997 -1.019344
Oregon  0.114370  1.086749  1.911401

In [263]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [264]:
frame.sort_index(axis=1, ascending=True)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [265]:
frame.sort_index(axis=0)

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [434]:
obj = Series([4, 7, -3, 2])
obj.order()  #sereis객체를 값에 따라 정렬할때 order 사용

2   -3
3    2
0    4
1    7
dtype: int64

In [435]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])  #숫자 아닌값들은 가장아래로 정렬
obj.order()

4    -3
5     2
0     4
2     7
1   NaN
3   NaN
dtype: float64

In [436]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [437]:
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [438]:
frame.sort_index()

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [270]:
frame.sort_index(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [271]:
frame.sort_index(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [440]:
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [441]:
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [442]:
obj.rank(method='first')  #데이터상에 나타나는 순서에따라 순위매김

0    6
1    1
2    7
3    4
4    3
5    2
6    5
dtype: float64

In [443]:
obj.rank(ascending=False, method='max')  #내림차순

0    2
1    7
2    2
3    4
4    5
5    6
6    4
dtype: float64

In [444]:
obj.rank(ascending=True, method='max')

0    7
1    1
2    7
3    5
4    3
5    2
6    5
dtype: float64

In [275]:
obj.rank(ascending=False, method='min')

0    1
1    7
2    1
3    3
4    5
5    6
6    3
dtype: float64

In [276]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1], 'c': [-2, 5, 8, -2.5]})

In [277]:
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [278]:
frame.rank(axis=1)

   a  b  c
0  2  3  1
1  1  3  2
2  2  1  3
3  2  3  1

### 5.2.7 중복 색인

- 색인 값이 중복된 Series 객체를 살펴보자

In [446]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [447]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [448]:
obj.index.is_unique
#is_unique 속성은 해당 값이 유일한지 아닌지 알려줌

False

In [449]:
obj['a']
#중복되는 색인 값이 있으면 Series 객체 반환

a    0
a    1
dtype: int64

In [450]:
obj['c']
#중복되는 색인 값이 없으면 스칼라 값 반환

4

In [451]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [452]:
df

          0         1         2
a -0.022928 -0.850344  0.561494
a -0.646756 -1.652894  1.607807
b  0.520266 -1.725776  0.056050
b  1.472639  0.918998 -0.547723

In [453]:
df.ix['b']  #로우선택할때

          0         1         2
b  0.520266 -1.725776  0.056050
b  1.472639  0.918998 -0.547723

## 5.3 기술통계 계산과 요약

In [454]:
#pandas의 메서드는 처음부터 누락된 데이터를 제외하도록 설계되었다.
df = DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'], columns=['one', 'two'])

In [456]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [457]:
df.sum()
#누락된거 제외하고 column에 대한 sum 연산결과

one    9.25
two   -5.80
dtype: float64

In [458]:
df.sum(axis=1)  #row에 대한 연산결과

a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64

In [459]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

- 전체 로우나 칼럼의 값이 NaN이 아니라면 계산과정에서 NaN값은 제외시키고 계산된다.
- 이는 skipna옵션을 통해 조정할 수 있다.
- mean은 평균을 구하는 메서드
- skipna -> NaN은 제외합니까? T(제외)/F(포함)

In [461]:
df.mean(axis=1, skipna=False) #평균계산  (NaN포함)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [463]:
df.mean(axis=1, skipna=True)#평균계산  (NaN제외)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [465]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [480]:
df['one'][0] = 1
df['one'][1] = 2
df['one'][2] = 3
df['one'][3] = 4

In [481]:
df

   one  two
a    1  NaN
b    2 -4.5
c    3  NaN
d    4 -1.3

In [482]:
df.describe()

            one       two
count  4.000000  2.000000
mean   2.500000 -2.900000
std    1.290994  2.262742
min    1.000000 -4.500000
25%    1.750000 -3.700000
50%    2.500000 -2.900000
75%    3.250000 -2.100000
max    4.000000 -1.300000

In [464]:
df.idxmax()  #max값을 가지는 index 반환

one    b
two    d
dtype: object

In [467]:
df.cumsum() #누적합을 구함(NaN은 제외)

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [469]:
df.describe()  #한번에 여러가지 통계결과는 만들어냄
#std = 표준편차

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [483]:
obj = Series(['a', 'a', 'b', 'c'] * 4)

In [484]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [486]:
obj.describe()
#count -> index의 수
#unique -> 중복제거된 값의 수
#top -> 첫번째 색인의 값
#freq -> 가장 빈번하게 나타난 값의 빈도

count     16
unique     3
top        a
freq       8
dtype: object

###5.3.1 상관관계와 공분산

In [487]:
import pandas.io.data as web

In [499]:
all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker, '2015-07-23', '2015-07-29')

In [500]:
all_data

{'AAPL':                   Open        High         Low       Close    Volume  \
 Date
 2015-07-23  126.199997  127.089996  125.059998  125.160004  50688700
 2015-07-24  125.320000  125.739998  123.900002  124.500000  41051600
 2015-07-27  123.089996  123.610001  122.120003  122.769997  44274800
 2015-07-28  123.379997  123.910004  122.550003  123.379997  33448900
 2015-07-29  123.150002  123.500000  122.269997  122.989998  35914200

              Adj Close
 Date
 2015-07-23  125.160004
 2015-07-24  124.500000
 2015-07-27  122.769997
 2015-07-28  123.379997
 2015-07-29  122.989998  ,
 'GOOG':                   Open        High         Low       Close   Volume  \
 Date
 2015-07-23  661.270020  663.630005  641.000000  644.280029  3001800
 2015-07-24  647.000000  648.169983  622.520020  623.559998  3608400
 2015-07-27  621.000000  634.299988  620.500000  627.260010  2668700
 2015-07-28  632.830017  632.830017  623.309998  628.000000  1704300
 2015-07-29  628.799988  633.359985  622.650024  631.929993  1565000

              Adj Close
 Date
 2015-07-23  644.280029
 2015-07-24  623.559998
 2015-07-27  627.260010
 2015-07-28  628.000000
 2015-07-29  631.929993  ,
 'IBM':                   Open        High         Low       Close   Volume  \
 Date
 2015-07-23  160.270004  162.750000  159.830002  161.729996  5003500
 2015-07-24  161.289993  161.929993  159.410004  159.750000  3566300
 2015-07-27  159.000000  160.179993  158.600006  159.070007  3695800
 2015-07-28  159.910004  160.190002  158.500000  160.050003  2608300
 2015-07-29  160.000000  161.500000  159.389999  161.089996  3341000

              Adj Close
 Date
 2015-07-23  161.729996
 2015-07-24  159.750000
 2015-07-27  159.070007
 2015-07-28  160.050003
 2015-07-29  161.089996  ,
 'MSFT':                  Open       High        Low      Close    Volume  Adj Close
 Date
 2015-07-23  45.270000  46.230000  45.099998  46.110001  33465600  46.110001
 2015-07-24  45.910000  46.320000  45.799999  45.939999  32077000  45.939999
 2015-07-27  45.939999  46.009998  45.250000  45.349998  39189900  45.349998
 2015-07-28  45.580002  45.639999  44.790001  45.340000  34177100  45.340000
 2015-07-29  45.400002  46.779999  45.259998  46.290001  40360400  46.290001}

In [501]:
all_data['IBM']

,Open,High,Low,Close,Volume,Adj Close
Date,,,,,,
2015-07-23,160.270004,162.750000,159.830002,161.729996,5003500,161.729996
2015-07-24,161.289993,161.929993,159.410004,159.750000,3566300,159.750000
2015-07-27,159.000000,160.179993,158.600006,159.070007,3695800,159.070007
2015-07-28,159.910004,160.190002,158.500000,160.050003,2608300,160.050003
2015-07-29,160.000000,161.500000,159.389999,161.089996,3341000,161.089996

In [502]:
type(all_data['IBM'])

pandas.core.frame.DataFrame

In [503]:
price = DataFrame({tic: data['Adj Close'] for tic, data in all_data.iteritems()})

In [504]:
type(data)

pandas.core.series.Series

In [505]:
price

                  AAPL        GOOG         IBM       MSFT
Date
2015-07-23  125.160004  644.280029  161.729996  46.110001
2015-07-24  124.500000  623.559998  159.750000  45.939999
2015-07-27  122.769997  627.260010  159.070007  45.349998
2015-07-28  123.379997  628.000000  160.050003  45.340000
2015-07-29  122.989998  631.929993  161.089996  46.290001

In [506]:
volume = DataFrame({tic: data['Volume'] for tic, data in all_data.iteritems()})

In [507]:
volume

                AAPL     GOOG      IBM      MSFT
Date
2015-07-23  50688700  3001800  5003500  33465600
2015-07-24  41051600  3608400  3566300  32077000
2015-07-27  44274800  2668700  3695800  39189900
2015-07-28  33448900  1704300  2608300  34177100
2015-07-29  35914200  1565000  3341000  40360400

In [508]:
returns = price.pct_change()

In [509]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2015-07-23       NaN       NaN       NaN       NaN
2015-07-24 -0.005273 -0.032160 -0.012243 -0.003687
2015-07-27 -0.013896  0.005934 -0.004257 -0.012843
2015-07-28  0.004969  0.001180  0.006161 -0.000220
2015-07-29 -0.003161  0.006258  0.006498  0.020953

In [511]:
returns.MSFT.corr(returns.IBM)
#각 칼럼의 상관관계를 계산함

0.6163094121510827

In [512]:
a = Series([-1, 0, 1])
b = Series([-0.1, 0, 0.1])

In [513]:
a.corr(b)

1.0

In [514]:
returns.MSFT.cov(returns.IBM)

7.9543568692798576e-05

In [515]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000 -0.019415  0.557899  0.447660
GOOG -0.019415  1.000000  0.797009  0.243786
IBM   0.557899  0.797009  1.000000  0.616309
MSFT  0.447660  0.243786  0.616309  1.000000

In [516]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000060 -0.000003  0.000039  0.000050
GOOG -0.000003  0.000341  0.000133  0.000064
IBM   0.000039  0.000133  0.000081  0.000080
MSFT  0.000050  0.000064  0.000080  0.000204

In [309]:
returns.corrwith(returns.IBM)

AAPL    0.381249
GOOG    0.319552
IBM     1.000000
MSFT    0.495311
dtype: float64

In [310]:
returns.corrwith(volume)

AAPL   -0.092393
GOOG    0.226231
IBM    -0.183956
MSFT   -0.097935
dtype: float64

### 5.3.2 유일 값, 값 세기, 멤버십

In [517]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [518]:
uniques = obj.unique()

In [519]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [520]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [521]:
pd.value_counts(obj.values, sort=False)

a    3
c    3
b    2
d    1
dtype: int64

In [522]:
pd.value_counts(obj.values, sort=True)

c    3
a    3
b    2
d    1
dtype: int64

- 여기서 obj는 시리즈 객체

In [525]:
mask = obj.isin(['b', 'c'])
#isin 메서드는 어떤 값이 Series에 있는지 나타내는 불리언 벡터를 반환함.

In [526]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [527]:
obj[mask]
#Series나 DataFrame의 칼럼에서 값을 골라내고 싶을 때 유용하게 사용할 수 있음.

0    c
5    b
6    b
7    c
8    c
dtype: object

In [528]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4], 
                  'Qu2': [2, 3, 1, 2, 3], 
                  'Qu3': [1, 5, 2, 4, 4]})

In [321]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

- DataFrame의 apply 함수에 pandas.value_counts를 넘기면 여러 로우에 대해 히스토그램을 구할 수 있음.
- fillna 함수를 이용해서 비어있는 값은 0으로 채워줌

In [322]:
result = data.apply(pd.value_counts).fillna(0)

In [323]:
result

   Qu1  Qu2  Qu3
1    1    1    1
2    0    2    1
3    2    2    0
4    2    0    2
5    0    0    1

## 5.4 누락된 데이터 처리하기

In [324]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [325]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [326]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [327]:
string_data[0] = None

In [328]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### 5.4.1 누락된 데이터 골라내기

In [531]:
from numpy import nan as NA
#dropna : 누락된 데이터가 있는 축을 제외시킴

In [530]:
data = Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [532]:
data[data.notnull()]
#불리언 색인을 이용한 방법.

0    1.0
2    3.5
4    7.0
dtype: float64

In [533]:
data.notnull()

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [534]:
#dropna는 기본적으로 NA값이 하나라도 있는 로우는 제외 시킴.
data = DataFrame([[1., 6.5, 3.], [1., NA, NA], 
                  [NA, NA, NA], [NA, 6.5, 3.]])

In [535]:
cleaned = data.dropna()

In [536]:
data

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

In [335]:
cleaned

   0    1  2
0  1  6.5  3

In [537]:
data.dropna(how='all')
#how='all' 옵션을 주면 모든 값이 NA인 로우만 제외시킴

    0    1   2
0   1  6.5   3
1   1  NaN NaN
3 NaN  6.5   3

In [538]:
data[4] = NA
#axis = 1을 주면 칼럼을 제외 시킬 수 있음

In [539]:
data

    0    1   2   4
0   1  6.5   3 NaN
1   1  NaN NaN NaN
2 NaN  NaN NaN NaN
3 NaN  6.5   3 NaN

In [339]:
data.dropna(axis=1, how='all')

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

In [340]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [540]:
df = DataFrame(np.random.randn(7, 3))

In [541]:
df.ix[:4, 1] = NA; df.ix[:2, 2] = NA #ix은 행을 말하는거임

In [542]:
df

          0         1         2
0  0.860068       NaN       NaN
1  0.032723       NaN       NaN
2 -0.247493       NaN       NaN
3  0.303426       NaN -1.780404
4  0.049728       NaN  0.462242
5  0.692172  1.642154 -0.720218
6  0.165619  0.127503  0.251899

In [544]:
df.dropna(thresh=3)
#몇개 이상의 값이 들어있는 로우만 살펴보고 싶다면 
#thresh 인자에 원하는 값을 넘기면 됨

          0         1         2
5  0.692172  1.642154 -0.720218
6  0.165619  0.127503  0.251899

### 5.4.2 누락된 값 채우기

In [545]:
df.fillna(0)
#fillna메서드에 채워 넣고 싶은 값을 넘겨줄 수 있음

          0         1         2
0  0.860068  0.000000  0.000000
1  0.032723  0.000000  0.000000
2 -0.247493  0.000000  0.000000
3  0.303426  0.000000 -1.780404
4  0.049728  0.000000  0.462242
5  0.692172  1.642154 -0.720218
6  0.165619  0.127503  0.251899

In [546]:
df.fillna({1: 0.5, 3: -1})
#각  칼럼마다 다른 값을 채워 넣을 수도 있음

          0         1         2
0  0.860068  0.500000       NaN
1  0.032723  0.500000       NaN
2 -0.247493  0.500000       NaN
3  0.303426  0.500000 -1.780404
4  0.049728  0.500000  0.462242
5  0.692172  1.642154 -0.720218
6  0.165619  0.127503  0.251899

In [552]:
_ = df.fillna(0, inplace=True)   #변수 _는 안쓰는변수 아무거나 갖다쓴거
# 기존 객체를 변경할 수도 있음.

In [553]:
df

          0         1         2
0  0.860068  0.000000  0.000000
1  0.032723  0.000000  0.000000
2 -0.247493  0.000000  0.000000
3  0.303426  0.000000 -1.780404
4  0.049728  0.000000  0.462242
5  0.692172  1.642154 -0.720218
6  0.165619  0.127503  0.251899

재색인에서 사용 가능한 보간 메서드는 fillna 메서드에서도 사용이 가능함.

In [349]:
df = DataFrame(np.random.randn(6, 3))

In [350]:
df.ix[2:, 1] = NA; df.ix[4:, 2] = NA

In [351]:
df

          0         1         2
0 -0.419366  1.365252  1.805241
1  1.629716 -0.451639 -0.370071
2 -0.771150       NaN  0.790795
3  1.151856       NaN -0.501844
4 -3.264501       NaN       NaN
5  0.634024       NaN       NaN

In [352]:
df.fillna(method='ffill')

          0         1         2
0 -0.419366  1.365252  1.805241
1  1.629716 -0.451639 -0.370071
2 -0.771150 -0.451639  0.790795
3  1.151856 -0.451639 -0.501844
4 -3.264501 -0.451639 -0.501844
5  0.634024 -0.451639 -0.501844

In [353]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.419366  1.365252  1.805241
1  1.629716 -0.451639 -0.370071
2 -0.771150 -0.451639  0.790795
3  1.151856 -0.451639 -0.501844
4 -3.264501       NaN -0.501844
5  0.634024       NaN -0.501844

In [354]:
#Series의 평균 값이나 중간 값등 다양한 값을 fillna를 이용해서 넣을 수 있음.
data = Series([1., NA, 3.5, NA, 7])

In [355]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 5.5 계층적 색인

In [554]:
#MultiIndex를 색인으로 하는 Series
data = Series(np.random.randn(10), 
              index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'], 
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])

In [555]:
data

a  1    0.468268
   2   -0.384866
   3    0.189648
b  1   -0.604967
   2    2.200585
   3    2.548781
c  1   -1.416911
   2    0.477686
d  2   -0.361572
   3    0.775049
dtype: float64

In [556]:
data.index

MultiIndex(levels=[[u'a', u'b', u'c', u'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [557]:
data['b']

1   -0.604967
2    2.200585
3    2.548781
dtype: float64

In [558]:
data['b':'c']

b  1   -0.604967
   2    2.200585
   3    2.548781
c  1   -1.416911
   2    0.477686
dtype: float64

In [559]:
data.ix[['b', 'd']]

b  1   -0.604967
   2    2.200585
   3    2.548781
d  2   -0.361572
   3    0.775049
dtype: float64

In [560]:
data[:, 2]

a   -0.384866
b    2.200585
c    0.477686
d   -0.361572
dtype: float64

In [563]:
data.unstack()
#unstack 메서드를 사용해서 데이터를 새롭게 배열할 수도 있음.

          1         2         3
a  0.468268 -0.384866  0.189648
b -0.604967  2.200585  2.548781
c -1.416911  0.477686       NaN
d       NaN -0.361572  0.775049

In [562]:
data.unstack().stack()

a  1    0.468268
   2   -0.384866
   3    0.189648
b  1   -0.604967
   2    2.200585
   3    2.548781
c  1   -1.416911
   2    0.477686
d  2   -0.361572
   3    0.775049
dtype: float64

In [566]:
frame = DataFrame(np.arange(12).reshape((4, 3)),  
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'], 
                           ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [567]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [367]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

### 5.5.1 계층 순서 바꾸고 정렬하기

In [568]:
frame.swaplevel('key1', 'key2')
#swaplevel은 넘겨받은 2개의 계층 번호나 이름이 뒤바뀐 새로운 객체를 반환함. (데이터 변경 X)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [569]:
frame.sortlevel(1)
# sortlevel 메서드는 단일 계층에 속한 데이터를 정렬.

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [370]:
frame.sortlevel()

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [371]:
frame.swaplevel(0, 1).sortlevel(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

### 5.5.2 단계별 요약통계

level 옵션은 어떤 한 축에 대해 합을 구하고 싶은 단계를 지정할 수 있는 옵션임.

In [372]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [373]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### 5.5.3 DataFrame의 칼럼 사용하기

In [374]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1), 
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'], 
                   'd': [0, 1, 2, 0, 1, 2, 3]})

In [375]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [376]:
frame2 = frame.set_index(['c', 'd'])

In [377]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [378]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [379]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

## 5.6 pandas와 관련된 기타 주제

### 5.6.1 정수 색인

In [571]:
ser = Series(np.arange(3.))

In [573]:
ser

0    0
1    1
2    2
dtype: float64

In [575]:

ser.iloc[-1]  #위치색인  (index location)

2.0

In [576]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

In [577]:
#일관성을 유쥐하기위해 색인 값을 가진 축 색인이 있을 경우 
#정수 데이터는 항상 이름을 지향함.
ser.ix[:1]

0    0
1    1
dtype: float64

In [384]:
ser3 = Series(range(3), index=[-5, 1, 3])
ser3.iloc[2]

2

In [579]:
ser3 = Series(range(3), index=[-5, 1, 3])
ser3.iget_value(2)   #ser3.iloc[2] 같음

2

In [584]:
frame = DataFrame(np.arange(6).reshape((3, 2)), index=[2, 0, 10])

frame

    0  1
2   0  1
0   2  3
10  4  5

In [585]:
frame.iloc[0]

0    0
1    1
Name: 2, dtype: int32

In [581]:
frame.irow(2)

0    4
1    5
Name: 1, dtype: int32

In [588]:
frame.ix[10]

0    4
1    5
Name: 10, dtype: int32

### 5.6.2 Panel 데이터

In [589]:
import pandas.io.data as web

In [597]:
pdata = pd.Panel(dict((stk, web.get_data_yahoo(stk)) 
                      for stk in ['AAPL', 'GOOG', 'MSFT', 'DELL']))
#panel은 dataframe을 여러개 들고있는거

In [594]:
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 1422 (major_axis) x 6 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2010-01-04 00:00:00 to 2015-07-29 00:00:00
Minor_axis axis: Open to Adj Close

In [591]:
pd.Panel?

In [602]:
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 1422 (major_axis) x 4 (minor_axis)
Items axis: Open to Adj Close
Major_axis axis: 2010-01-04 00:00:00 to 2015-07-29 00:00:00
Minor_axis axis: AAPL to MSFT

In [603]:
pdata['AAPL']

KeyError: 'AAPL'

In [599]:
pdata = pdata.swapaxes('items', 'minor')

In [600]:
pdata['Adj Close']

                  AAPL      DELL        GOOG       MSFT
Date
2010-01-04   28.718094  14.06528         NaN  26.769336
2010-01-05   28.767737  14.38450         NaN  26.777984
2010-01-06   28.310151  14.10397         NaN  26.613650
2010-01-07   28.257821  14.23940         NaN  26.336875
2010-01-08   28.445687  14.36516         NaN  26.518508
2010-01-11   28.194745  14.37483         NaN  26.181189
2010-01-12   27.874037  14.56830         NaN  26.008204
2010-01-13   28.267213  14.57797         NaN  26.250383
2010-01-14   28.103497  14.22005         NaN  26.777984
2010-01-15   27.633830  13.92985         NaN  26.691493
2010-01-19   28.856306  14.32646         NaN  26.899074
2010-01-20   28.412135  14.03626         NaN  26.457964
2010-01-21   27.921004  13.92017         NaN  25.956309
2010-01-22   26.536154  13.18982         NaN  25.048140
2010-01-25   27.250048  13.43650         NaN  25.359512
2010-01-26   27.635174  13.13662         NaN  25.515199
2010-01-27   27.895500  13.08825         NaN  25.662235
2010-01-28   26.742807  12.84641         NaN  25.221125
2010-01-29   25.772608  12.47882         NaN  24.373502
2010-02-01   26.130897  12.78837         NaN  24.572434
2010-02-02   26.282534  12.86576         NaN  24.615679
2010-02-03   26.734757  12.92380         NaN  24.762716
2010-02-04   25.771266  12.58523         NaN  24.079428
2010-02-05   26.228860  12.80772         NaN  24.235114
2010-02-08   26.049045  12.95282         NaN  23.975637
2010-02-09   26.326814  13.10760         NaN  24.226465
2010-02-10   26.183238  13.30107         NaN  24.209166
2010-02-11   26.659611  13.49454         NaN  24.321607
2010-02-12   26.889071  13.38813         NaN  24.157271
2010-02-16   27.294328  13.67834         NaN  24.635203
...                ...       ...         ...        ...
2015-06-17  127.300003       NaN  529.260010  45.970001
2015-06-18  127.879997       NaN  536.729980  46.720001
2015-06-19  126.599998       NaN  536.690002  46.099998
2015-06-22  127.610001       NaN  538.190002  46.230000
2015-06-23  127.029999       NaN  540.479980  45.910000
2015-06-24  128.110001       NaN  537.840027  45.639999
2015-06-25  127.500000       NaN  535.229980  45.650002
2015-06-26  126.750000       NaN  531.690002  45.259998
2015-06-29  124.529999       NaN  521.520020  44.369999
2015-06-30  125.430000       NaN  520.510010  44.150002
2015-07-01  126.599998       NaN  521.840027  44.450001
2015-07-02  126.440002       NaN  523.400024  44.400002
2015-07-06  126.000000       NaN  522.859985  44.389999
2015-07-07  125.690002       NaN  525.020020  44.299999
2015-07-08  122.570000       NaN  516.830017  44.240002
2015-07-09  120.070000       NaN  520.679993  44.520000
2015-07-10  123.279999       NaN  530.130005  44.610001
2015-07-13  125.660004       NaN  546.549988  45.540001
2015-07-14  125.610001       NaN  561.099976  45.619999
2015-07-15  126.820000       NaN  560.219971  45.759998
2015-07-16  128.509995       NaN  579.849976  46.660000
2015-07-17  129.619995       NaN  672.929993  46.619999
2015-07-20  132.070007       NaN  663.020020  46.919998
2015-07-21  130.750000       NaN  662.299988  47.279999
2015-07-22  125.220001       NaN  662.099976  45.540001
2015-07-23  125.160004       NaN  644.280029  46.110001
2015-07-24  124.500000       NaN  623.559998  45.939999
2015-07-27  122.769997       NaN  627.260010  45.349998
2015-07-28  123.379997       NaN  628.000000  45.340000
2015-07-29  122.989998       NaN  631.929993  46.290001

[1422 rows x 4 columns]

In [607]:
pdata.ix[:, '2012-06-01', :]

            Open        High         Low       Close     Volume  Adj Close
AAPL  569.159996  572.649956  560.520012  560.990036  130246900  75.279486
DELL   12.150000   12.300000   12.045000   12.070000   19397600  11.675920
GOOG         NaN         NaN         NaN         NaN        NaN        NaN
MSFT   28.760000   28.959999   28.440001   28.450001   56634300  26.126961

In [608]:
pdata[:, '2012-06-01', :]  #ix없어도 똑같음

            Open        High         Low       Close     Volume  Adj Close
AAPL  569.159996  572.649956  560.520012  560.990036  130246900  75.279486
DELL   12.150000   12.300000   12.045000   12.070000   19397600  11.675920
GOOG         NaN         NaN         NaN         NaN        NaN        NaN
MSFT   28.760000   28.959999   28.440001   28.450001   56634300  26.126961

In [615]:
type(pdata[:, '2012-06-01', :])

pandas.core.frame.DataFrame

In [612]:
pdata['Adj Close', '2012-05-22':, :]

                  AAPL      DELL        GOOG       MSFT
Date
2012-05-22   74.740031  14.58765         NaN  27.329995
2012-05-23   76.563680  12.08221         NaN  26.733070
2012-05-24   75.860527  12.04351         NaN  26.696335
2012-05-25   75.453926  12.05319         NaN  26.687151
2012-05-28         NaN  12.05319         NaN        NaN
2012-05-29   76.793152  12.24666         NaN  27.146325
2012-05-30   77.719062  12.14992         NaN  26.944289
2012-05-31   77.525831  11.92743         NaN  26.806537
2012-06-01   75.279486  11.67592         NaN  26.126961
2012-06-04   75.722313  11.60821         NaN  26.218794
2012-06-05   75.526394  11.76298         NaN  26.182061
2012-06-06   76.684450  11.81619         NaN  26.953473
2012-06-07   76.719351  11.73396         NaN  26.843270
2012-06-08   77.873386  11.72429         NaN  27.228976
2012-06-11   76.645536  11.47278         NaN  26.540216
2012-06-12   77.315149  11.57919         NaN  26.898372
2012-06-13   76.778382  11.87423         NaN  26.751435
2012-06-14   76.693845  11.93711         NaN  26.944289
2012-06-15   77.042741  11.89841         NaN  27.568765
2012-06-18   78.606065  12.01449         NaN  27.403462
2012-06-19   78.824788  11.78233         NaN  28.193241
2012-06-20   78.600690  11.89841         NaN  28.404460
2012-06-21   77.517783  11.60821         NaN  27.678965
2012-06-22   78.112240  11.80168         NaN  28.193241
2012-06-25   76.591858  11.55500         NaN  27.431013
2012-06-26   76.760939  11.53565         NaN  27.568765
2012-06-27   77.092391  11.92743         NaN  27.706517
2012-06-28   76.361060  11.55984         NaN  27.467746
2012-06-29   78.367204  12.10155         NaN  28.092222
2012-07-02   79.510504  11.98064         NaN  28.064671
...                ...       ...         ...        ...
2015-06-17  127.300003       NaN  529.260010  45.970001
2015-06-18  127.879997       NaN  536.729980  46.720001
2015-06-19  126.599998       NaN  536.690002  46.099998
2015-06-22  127.610001       NaN  538.190002  46.230000
2015-06-23  127.029999       NaN  540.479980  45.910000
2015-06-24  128.110001       NaN  537.840027  45.639999
2015-06-25  127.500000       NaN  535.229980  45.650002
2015-06-26  126.750000       NaN  531.690002  45.259998
2015-06-29  124.529999       NaN  521.520020  44.369999
2015-06-30  125.430000       NaN  520.510010  44.150002
2015-07-01  126.599998       NaN  521.840027  44.450001
2015-07-02  126.440002       NaN  523.400024  44.400002
2015-07-06  126.000000       NaN  522.859985  44.389999
2015-07-07  125.690002       NaN  525.020020  44.299999
2015-07-08  122.570000       NaN  516.830017  44.240002
2015-07-09  120.070000       NaN  520.679993  44.520000
2015-07-10  123.279999       NaN  530.130005  44.610001
2015-07-13  125.660004       NaN  546.549988  45.540001
2015-07-14  125.610001       NaN  561.099976  45.619999
2015-07-15  126.820000       NaN  560.219971  45.759998
2015-07-16  128.509995       NaN  579.849976  46.660000
2015-07-17  129.619995       NaN  672.929993  46.619999
2015-07-20  132.070007       NaN  663.020020  46.919998
2015-07-21  130.750000       NaN  662.299988  47.279999
2015-07-22  125.220001       NaN  662.099976  45.540001
2015-07-23  125.160004       NaN  644.280029  46.110001
2015-07-24  124.500000       NaN  623.559998  45.939999
2015-07-27  122.769997       NaN  627.260010  45.349998
2015-07-28  123.379997       NaN  628.000000  45.340000
2015-07-29  122.989998       NaN  631.929993  46.290001

[815 rows x 4 columns]

In [611]:
stacked = pdata.ix[:, '2012-05-30':, :].to_frame()

In [613]:
type(stacked)

pandas.core.frame.DataFrame

In [394]:
stacked

                        Open        High         Low       Close     Volume  \
Date       minor
2012-05-30 AAPL   569.200050  579.989990  566.559990  579.169998  132357400
           DELL    12.590000   12.700000   12.460000   12.560000   19787800
           MSFT    29.350000   29.480000   29.120001   29.340000   41585500
2012-05-31 AAPL   580.740021  581.499985  571.459969  577.730019  122918600
           DELL    12.530000   12.540000   12.330000   12.330000   19955600
           MSFT    29.299999   29.420000   28.940001   29.190001   39134000
2012-06-01 AAPL   569.159996  572.649956  560.520012  560.990036  130246900
           DELL    12.150000   12.300000   12.045000   12.070000   19397600
           MSFT    28.760000   28.959999   28.440001   28.450001   56634300
2012-06-04 AAPL   561.500008  567.499985  548.499977  564.290031  139248900
           DELL    12.110000   12.112500   11.800000   12.000000   17015700
           MSFT    28.620001   28.780001   28.320000   28.549999   47926300
2012-06-05 AAPL   561.269989  566.470055  558.330002  562.830025   97053600
           DELL    11.950000   12.240000   11.950000   12.160000   15620900
           MSFT    28.510000   28.750000   28.389999   28.510000   45715400
2012-06-06 AAPL   567.770004  573.849983  565.499992  571.459969  100363900
           DELL    12.210000   12.280000   12.090000   12.215000   20779900
           MSFT    28.879999   29.370001   28.809999   29.350000   46860500
2012-06-07 AAPL   577.290009  577.320023  570.500000  571.720055   94941700
           DELL    12.320000   12.410000   12.120000   12.130000   20074000
           MSFT    29.639999   29.700001   29.170000   29.230000   37792800
2012-06-08 AAPL   571.599998  580.580017  568.999992  580.320038   86879100
           DELL    12.130000   12.225000   12.020000   12.120000   18155600
           MSFT    29.209999   29.680000   29.049999   29.650000   42551100
2012-06-11 AAPL   587.719994  588.499985  570.629990  571.169975  147816200
           DELL    12.150000   12.200000   11.820000   11.860000   16931900
           MSFT    29.730000   29.809999   28.820000   28.900000   46361900
2012-06-12 AAPL   574.459984  576.620033  566.699966  576.159996  108845100
           DELL    11.910000   12.010000   11.680000   11.970000   17608100
           MSFT    29.100000   29.299999   28.840000   29.290001   35337900
...                      ...         ...         ...         ...        ...
2015-07-16 AAPL   127.739998  128.570007  127.349998  128.509995   35866800
           GOOG   565.119995  580.679993  565.000000  579.849976    4053900
           MSFT    46.009998   46.689999   45.970001   46.660000   25894400
2015-07-17 AAPL   129.080002  129.619995  128.309998  129.619995   45693300
           GOOG   649.000000  674.468018  645.000000  672.929993   11134500
           MSFT    46.549999   46.779999   46.259998   46.619999   29262900
2015-07-20 AAPL   130.970001  132.970001  130.699997  132.070007   54159800
           GOOG   659.239990  668.880005  653.010010  663.020020    5848800
           MSFT    46.650002   47.130001   46.439999   46.919998   30271200
2015-07-21 AAPL   132.850006  132.919998  130.320007  130.750000   58898800
           GOOG   655.210022  673.000000  654.299988  662.299988    3348400
           MSFT    46.779999   47.330002   46.480000   47.279999   41205000
2015-07-22 AAPL   121.989998  125.500000  121.989998  125.220001  114692800
           GOOG   660.890015  678.640015  659.000000  662.099976    3689600
           MSFT    45.439999   46.930000   45.200001   45.540001   58724600
2015-07-23 AAPL   126.199997  127.089996  125.059998  125.160004   50688700
           GOOG   661.270020  663.630005  641.000000  644.280029    3001800
           MSFT    45.270000   46.230000   45.099998   46.110001   33465600
2015-07-24 AAPL   125.320000  125.739998  123.900002  124.500000   41051600
           GOOG   647.000000  648.169983  622.520020  623.559998    3608400
           MSFT    45.910000   46.320000   45.799999   45.939999   32077000
2015-07-27 AAPL   123.089996  123.610001  122.120003  122.769997   44274800
           GOOG   621.000000  634.299988  620.500000  627.260010    2668700
           MSFT    45.939999   46.009998   45.250000   45.349998   39189900
2015-07-28 AAPL   123.379997  123.910004  122.550003  123.379997   33448900
           GOOG   632.830017  632.830017  623.309998  628.000000    1704300
           MSFT    45.580002   45.639999   44.790001   45.340000   34177100
2015-07-29 AAPL   123.150002  123.500000  122.269997  122.989998   35914200
           GOOG   628.799988  633.359985  622.650024  631.929993    1565000
           MSFT    45.400002   46.779999   45.259998   46.290001   40360400

                   Adj Close
Date       minor
2012-05-30 AAPL    77.719062
           DELL    12.149920
           MSFT    26.944289
2012-05-31 AAPL    77.525831
           DELL    11.927430
           MSFT    26.806537
2012-06-01 AAPL    75.279486
           DELL    11.675920
           MSFT    26.126961
2012-06-04 AAPL    75.722313
           DELL    11.608210
           MSFT    26.218794
2012-06-05 AAPL    75.526394
           DELL    11.762980
           MSFT    26.182061
2012-06-06 AAPL    76.684450
           DELL    11.816190
           MSFT    26.953473
2012-06-07 AAPL    76.719351
           DELL    11.733960
           MSFT    26.843270
2012-06-08 AAPL    77.873386
           DELL    11.724290
           MSFT    27.228976
2012-06-11 AAPL    76.645536
           DELL    11.472780
           MSFT    26.540216
2012-06-12 AAPL    77.315149
           DELL    11.579190
           MSFT    26.898372
...                      ...
2015-07-16 AAPL   128.509995
           GOOG   579.849976
           MSFT    46.660000
2015-07-17 AAPL   129.619995
           GOOG   672.929993
           MSFT    46.619999
2015-07-20 AAPL   132.070007
           GOOG   663.020020
           MSFT    46.919998
2015-07-21 AAPL   130.750000
           GOOG   662.299988
           MSFT    47.279999
2015-07-22 AAPL   125.220001
           GOOG   662.099976
           MSFT    45.540001
2015-07-23 AAPL   125.160004
           GOOG   644.280029
           MSFT    46.110001
2015-07-24 AAPL   124.500000
           GOOG   623.559998
           MSFT    45.939999
2015-07-27 AAPL   122.769997
           GOOG   627.260010
           MSFT    45.349998
2015-07-28 AAPL   123.379997
           GOOG   628.000000
           MSFT    45.340000
2015-07-29 AAPL   122.989998
           GOOG   631.929993
           MSFT    46.290001

[2300 rows x 6 columns]

In [395]:
stacked.to_panel()

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 809 (major_axis) x 4 (minor_axis)
Items axis: Open to Adj Close
Major_axis axis: 2012-05-30 00:00:00 to 2015-07-29 00:00:00
Minor_axis axis: AAPL to MSFT